{
  "backend/main.mo": "Motoko backend defining consultancy and partner registration data models with CRUD-like submission, retrieval, and status-update functions stored in Maps.",
  "feature_evidence.json": "Feature evidence report listing implemented features, involved files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend project files.",
  "frontend/index.css": "Global Tailwind CSS configuration defining OKLCH color tokens, dark mode variables, and base style resets.",
  "frontend/index.html": "HTML entry point that sets metadata, loads the favicon, and mounts the React app.",
  "frontend/src/App.tsx": "Main React application setup configuring routing, theming, global layout, and providers.",
  "frontend/src/components/CareerSection.tsx": "Empty placeholder file for the CareerSection component.",
  "frontend/src/components/ContactSection.tsx": "Empty placeholder file for the ContactSection component.",
  "frontend/src/components/Footer.tsx": "Footer with upgraded logo usage, social links, navigation buttons, and brand text pulled from branding constants.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, navigation menus, and mobile menu handling using dropdowns and router navigation.",
  "frontend/src/components/Hero.tsx": "Empty placeholder component file.",
  "frontend/src/components/Products.tsx": "Empty placeholder component file.",
  "frontend/src/components/ScrollToTop.tsx": "Scroll handler that forces window scroll to top on mount and on route changes using the router subscription.",
  "frontend/src/components/SolarCalculatorAssumptions.tsx": "UI card displaying solar calculation assumptions with badges for tariff, generation, space, and self‑consumption.",
  "frontend/src/components/WhatsAppFab.tsx": "Floating WhatsApp action button linking to a prefilled chat message.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login flow, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor methods for submitting forms and fetching consultancy, partner, offerings, and solutions data.",
  "frontend/src/index.css": "Tailwind setup defining theme variables, dark mode overrides, and utility animations.",
  "frontend/src/lib/branding.ts": "Exports logo asset paths and brand constants for Solar Sparkle.",
  "frontend/src/lib/formatCurrency.ts": "Utility functions for formatting Indian currency and numbers, including compact lakh/crore formatting.",
  "frontend/src/lib/solarCalculator.ts": "Implements solar system sizing, cost, savings, and environmental impact calculations with input validation and roof-area constraints.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CareersPage.tsx": "Renders a careers page with upcoming job listings, benefits, and future roles.",
  "frontend/src/pages/CommercialSolarPage.tsx": "Displays commercial solar solution details, benefits, and a consultation CTA with imagery.",
  "frontend/src/pages/ExpertConsultancyPage.tsx": "Provides a form for users to request expert solar consultancy, handling validation and submission.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring solar calculator inputs, validation, result display, and promotional sections.",
  "frontend/src/pages/HybridSystemPage.tsx": "Presents a marketing page for hybrid solar systems with feature explanations, steps, and a call-to-action button. Includes imagery and navigation to the consultancy page.",
  "frontend/src/pages/IndustrialSolarPage.tsx": "Displays an industrial solar solutions page with high-capacity features, benefits cards, and navigation to an assessment request. Includes hero imagery and descriptive sections.",
  "frontend/src/pages/OffGridSystemPage.tsx": "Provides an overview of off-grid solar systems with explanations of system components, benefits, and imagery. Includes a CTA button linking to expert consultancy.",
  "frontend/src/pages/OnGridSystemPage.tsx": "Shows an on-grid solar system page with descriptions of grid-connected workflows, benefits, and a consultancy CTA. Contains visual sections and step-by-step explanations.",
  "frontend/src/pages/ResidentialSolarPage.tsx": "A residential solar marketing page featuring benefits, animated UI elements, imagery, and a consultancy CTA. Includes multiple feature cards highlighting advantages for homeowners.",
  "frontend/src/pages/SolarAttaChakkiPage.tsx": "React page describing a solar-powered atta chakki product with benefits, imagery, and a CTA button.",
  "frontend/src/pages/SolarCalculatorPage.tsx": "Empty or placeholder page with no content provided.",
  "frontend/src/pages/SolarWaterPumpPage.tsx": "React page presenting a solar water pump product, highlighting key advantages and including a CTA button and product image.",
  "frontend/src/pages/TrustedPartnerPage.tsx": "React page featuring a partner registration form with validation and submission logic plus promotional content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, shadows, animations, and container settings.",
  "project_state.json": "Metadata file describing project state, logo‑upgrade requirements, and existing feature definitions."
}