{
  "backend/main.mo": "Actor manages consultancy forms and partner registrations with create, list, and status‑update functions using Map storage.",
  "feature_evidence.json": "Feature evidence report describing removal of a specific hyperlink in Footer.tsx with metadata and related components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend source files for reference.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app setup configuring router routes, global layout, theme provider, and query client.",
  "frontend/src/components/CareerSection.tsx": "Empty component file placeholder for the CareerSection component.",
  "frontend/src/components/ContactSection.tsx": "Empty component file placeholder for the ContactSection component.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, social links, navigation buttons, and descriptive text.",
  "frontend/src/components/Header.tsx": "Header component with logo, navigation menus, dropdowns, and mobile menu handling.",
  "frontend/src/components/Hero.tsx": "Empty component file placeholder for the Hero component.",
  "frontend/src/components/Products.tsx": "Empty component file placeholder for the Products component.",
  "frontend/src/components/ScrollToTop.tsx": "Scrolls to top on mount and on route load by subscribing to router events.",
  "frontend/src/components/SolarCalculatorAssumptions.tsx": "Displays solar calculation assumptions using UI cards and badges based on provided data.",
  "frontend/src/components/WhatsAppFab.tsx": "Floating WhatsApp button that opens a prefilled chat message to a fixed phone number.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication via DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for submitting and fetching consultancy forms, partner registrations, offerings, and solutions through the actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables, themes, and animation utilities for the app.",
  "frontend/src/lib/formatCurrency.ts": "Utility for formatting INR values with Indian numbering system and optional compact notation.",
  "frontend/src/lib/solarCalculator.ts": "Implements solar system calculations, assumptions, validation, and cost/savings estimation logic.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider before rendering the root component.",
  "frontend/src/pages/CareersPage.tsx": "Displays a careers page with a hero section, upcoming job openings notice, and lists of company benefits and future roles.",
  "frontend/src/pages/CommercialSolarPage.tsx": "Renders a commercial solar solutions page with a hero section, business benefits cards, and a CTA for consultation.",
  "frontend/src/pages/ExpertConsultancyPage.tsx": "Implements a consultation request page with a form, validation, submission handling, and a hero section.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage featuring a solar savings calculator, validation logic, and multiple marketing sections.",
  "frontend/src/pages/HybridSystemPage.tsx": "Shows a hybrid solar system overview with a hero section, explanation steps, and a CTA to request a quote.",
  "frontend/src/pages/IndustrialSolarPage.tsx": "Presents industrial solar solutions with a hero section and cards outlining high‑capacity, storage, and durability features.",
  "frontend/src/pages/OffGridSystemPage.tsx": "Renders an off-grid solar system marketing page with descriptions, steps, and a quote CTA.",
  "frontend/src/pages/OnGridSystemPage.tsx": "Renders an on-grid solar system page explaining grid-connected benefits and system steps with a quote CTA.",
  "frontend/src/pages/ResidentialSolarPage.tsx": "Shows a residential solar solutions page highlighting benefits, features, and a consultation CTA.",
  "frontend/src/pages/SolarAttaChakkiPage.tsx": "Presents a solar-powered atta chakki product page with benefits and a quote CTA.",
  "frontend/src/pages/SolarCalculatorPage.tsx": "Empty placeholder file for a future solar calculator page.",
  "frontend/src/pages/SolarWaterPumpPage.tsx": "Displays a solar water pump product page outlining benefits and offering a quote CTA.",
  "frontend/src/pages/TrustedPartnerPage.tsx": "React page rendering a partner registration form with validation, image section, and mutation submission using a custom hook with toast notifications.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, shadows, and container settings while enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Metadata describing project state, feature requests, versions, and a pending task to remove a footer link."
}