{
  "backend/main.mo": "Motoko backend handling access control, user profiles, and submission storage for consultancy, partner registration, and AMC enquiries with ID generation.",
  "feature_evidence.json": "Feature evidence report detailing build‑fix tasks for empty TSX components and a troubleshooting note update.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of various frontend components, hooks, pages, and utilities.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites and steps for verifying and deploying the app to the IC mainnet.",
  "frontend/GOOGLE_SHEETS_EXPORT.md": "Guide for configuring optional Google Sheets export via Apps Script for form submissions.",
  "frontend/index.css": "Tailwind‑based global style definitions including extensive OKLCH color tokens and dark‑mode variables.",
  "frontend/index.html": "HTML entry point defining metadata, root mount point, and runtime Google Sheets config placeholders.",
  "frontend/src/App.tsx": "Main React app defining layout, router configuration, and route components for all pages including admin submissions.",
  "frontend/src/components/CareerSection.tsx": "Placeholder React component exporting a minimal CareerSection element.",
  "frontend/src/components/ContactSection.tsx": "Placeholder React component exporting a minimal ContactSection element.",
  "frontend/src/components/Footer.tsx": "Renders a footer with branding, navigation buttons, and social media links using react-icons and TanStack Router.",
  "frontend/src/components/Header.tsx": "Provides a responsive header with navigation menus, dropdowns, and mobile menu handling using TanStack Router.",
  "frontend/src/components/Hero.tsx": "Placeholder Hero component rendering an empty container.",
  "frontend/src/components/Products.tsx": "Placeholder Products component rendering an empty container.",
  "frontend/src/components/ScrollToTop.tsx": "Scrolls the page to the top on mount and on route changes by subscribing to TanStack Router events.",
  "frontend/src/components/SolarCalculatorAssumptions.tsx": "Displays solar calculation assumptions in a styled card using values from a SolarAssumptions object.",
  "frontend/src/components/WhatsAppFab.tsx": "Floating WhatsApp button linking to a preset chat message using a generated wa.me URL.",
  "frontend/src/config/googleSheetsConfig.ts": "Retrieves Google Sheets API configuration from window config or environment variables and provides helper checks for enabled exports.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when the actor updates.",
  "frontend/src/hooks/useAdmin.ts": "Queries the backend to determine if the current authenticated user is an admin, syncing with actor and identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, identities, and login state via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for submitting forms and fetching admin-protected data using an actor instance.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables, dark mode theming, and animation utilities.",
  "frontend/src/lib/formatCurrency.ts": "Provides INR currency and number formatting utilities, including compact formats for lakhs and crores.",
  "frontend/src/lib/formatTimestamp.ts": "Converts nanosecond timestamps into human-readable localized date strings.",
  "frontend/src/lib/googleSheetsExport.ts": "Utilities to export various form submissions to Google Sheets via configured HTTP endpoints.",
  "frontend/src/lib/solarCalculator.ts": "Implements solar system sizing, cost estimation, environmental impact calculations, and input validation.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, identity provider, and global styles.",
  "frontend/src/pages/AdminSubmissionsPage.tsx": "Admin dashboard page handling authentication, role checks, and displaying all form submissions.",
  "frontend/src/pages/AmcPage.tsx": "Form page for submitting AMC enquiries, handling validation, backend submission, optional Google Sheets export, and UI layout.",
  "frontend/src/pages/CareersPage.tsx": "Static careers page showing upcoming job openings, company values, and future roles.",
  "frontend/src/pages/CommercialSolarPage.tsx": "Landing page describing commercial solar solutions, benefits, and a call-to-action for consultancy.",
  "frontend/src/pages/ExpertConsultancyPage.tsx": "Form page for requesting expert solar consultancy with backend submission, Google Sheets export, retries, and validation.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a solar savings calculator, input validation, results display, and marketing sections.",
  "frontend/src/pages/HybridSystemPage.tsx": "Promotional page explaining hybrid solar systems, benefits, workflow steps, and a link to consultancy.",
  "frontend/src/pages/IndustrialSolarPage.tsx": "Page presenting industrial solar solutions with hero section, feature cards, and navigation to consultancy.",
  "frontend/src/pages/OffGridSystemPage.tsx": "Page describing off‑grid solar systems with workflow steps, imagery, and a button linking to consultancy.",
  "frontend/src/pages/OnGridSystemPage.tsx": "Page explaining on‑grid solar systems, including process steps, benefits, and navigation to consultancy.",
  "frontend/src/pages/ResidentialSolarPage.tsx": "Page showcasing residential solar solutions with animated hero, benefits cards, and a consultancy CTA.",
  "frontend/src/pages/SolarAttaChakkiPage.tsx": "Page detailing solar-powered atta chakki products with benefits, imagery, and a quote request button.",
  "frontend/src/pages/SolarCalculatorPage.tsx": "No summary available.",
  "frontend/src/pages/SolarWaterPumpPage.tsx": "React page displaying marketing content for a solar water pump with images, feature cards, and a navigation button to the consultancy page.",
  "frontend/src/pages/TrustedPartnerPage.tsx": "React page providing a partner registration form with validation, backend submission, optional Google Sheets export, and retry handling.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL and session parameters, supporting both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, shadows, keyframes, and container settings for the project’s UI theme.",
  "project_state.json": "Metadata file describing project state, known issues, feature requirements, and admin authentication plans."
}