{
  "backend/main.mo": "Actor implementing storage, submission, retrieval, and status updates for consultancy forms and partner registrations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to relevant frontend files and metadata.",
  "frontend-file-summaries.txt": "Pre-written summaries of various frontend files detailing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode tokens, and base styles.",
  "frontend/index.html": "Base HTML entry file mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Main app entry configuring TanStack Router routes, layout, providers, and global ScrollToTop.",
  "frontend/src/components/CareerSection.tsx": "Placeholder or empty file for the career section component.",
  "frontend/src/components/ContactSection.tsx": "Placeholder or empty file for the contact section component.",
  "frontend/src/components/Footer.tsx": "Footer component with navigation buttons, social links, offerings list, and updated contact details.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, navigation menus, and route handling for desktop and mobile.",
  "frontend/src/components/Hero.tsx": "Empty placeholder component file.",
  "frontend/src/components/Products.tsx": "Empty placeholder component file.",
  "frontend/src/components/ScrollToTop.tsx": "Scroll-to-top utility that resets scroll on mount and on route changes using router events.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actors based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for submitting forms and fetching consultancy forms, partner registrations, offerings, and solutions via the actor.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables, themes, utilities, and animation definitions.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/CareersPage.tsx": "Static careers page showing company intro, job openings placeholder, and benefits lists.",
  "frontend/src/pages/CommercialSolarPage.tsx": "Renders the commercial solar solutions page with a hero section, business benefits cards, and navigation to the consultancy page.",
  "frontend/src/pages/ExpertConsultancyPage.tsx": "Provides a hero section and a consultation form that submits user details via a mutation hook with validation and toast feedback.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a solar savings calculator, animated hero content, and navigation to consultancy services.",
  "frontend/src/pages/HybridSystemPage.tsx": "Displays information about hybrid solar systems with a hero section and step-by-step explanation, plus navigation to request a quote.",
  "frontend/src/pages/IndustrialSolarPage.tsx": "Shows industrial solar offerings with a hero banner and feature cards emphasizing capacity, storage, and durability, with a link to consultancy.",
  "frontend/src/pages/OffGridSystemPage.tsx": "Renders a marketing page describing off-grid solar systems, their workflow steps, and a call-to-action for quotes.",
  "frontend/src/pages/OnGridSystemPage.tsx": "Provides an overview of on-grid solar systems with explanations of how they work and a CTA for consultation.",
  "frontend/src/pages/ResidentialSolarPage.tsx": "Displays a residential solar solutions page with benefits, visuals, and a consultation button.",
  "frontend/src/pages/SolarAttaChakkiPage.tsx": "Shows a solar-powered atta chakki product page describing benefits and operational advantages.",
  "frontend/src/pages/SolarCalculatorPage.tsx": "Empty placeholder file for a solar calculator page.",
  "frontend/src/pages/SolarWaterPumpPage.tsx": "Presents a solar water pump product page detailing its features, benefits, and use cases.",
  "frontend/src/pages/TrustedPartnerPage.tsx": "Implements a partner registration page with a form, validation, submission via a mutation hook, and a hero section with descriptive content.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Stores project metadata, known issues, existing features, and pending feature requests for the Solar Sparkle application."
}