{
  "kind": "build_request",
  "title": "Upgrade Solar Sparkle logo and apply across header/footer",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create an upgraded Solar Sparkle logo based on the two user-uploaded references (image-12.png, ONLY LOGO.jpeg), keeping the same recognizable solar + panel concept but with cleaner geometry, sharper edges, consistent stroke widths, improved contrast, and transparent background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "UPGRADE THIS LOGO AS"
        ]
      },
      "acceptanceCriteria": [
        "New logo files are produced as static images (PNG) with transparent background.",
        "Logo appears crisp at small sizes (e.g., 32–48px height) without visible jagged edges or blurred artifacts.",
        "Color palette is cohesive and modern (no muddy gradients or low-contrast details)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the upgraded logo image assets to the frontend as static files under frontend/public/assets/generated and ensure no runtime/backend dependency is required to load them.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "UPGRADE THIS LOGO AS"
        ]
      },
      "acceptanceCriteria": [
        "Upgraded logo assets exist in frontend/public/assets/generated.",
        "The app loads the logo assets via /assets/generated/... paths with no network calls besides static asset fetches."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the site to use the upgraded logo consistently in both the header and footer, replacing the current header logo source (/assets/solar_sparkle-removebg-preview.png) and the current footer logo source (/assets/generated/solar-sparkle-logo-transparent.dim_200x200.png).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "UPGRADE THIS LOGO AS"
        ]
      },
      "acceptanceCriteria": [
        "Header (frontend/src/components/Header.tsx) uses the new generated logo asset path.",
        "Footer (frontend/src/components/Footer.tsx) uses the new generated logo asset path.",
        "Logo sizing remains visually balanced (no layout shift or overflow) on mobile and desktop breakpoints."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a favicon using the upgraded logo and wire it into the HTML head so browser tabs show the updated branding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "UPGRADE THIS LOGO AS"
        ]
      },
      "acceptanceCriteria": [
        "A favicon image file exists in frontend/public (or another appropriate static location) and is referenced from frontend/index.html.",
        "After build, the browser tab displays the new favicon."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep backend unchanged; do not add new canisters/services or external dependencies."
  ],
  "nonGoals": [
    "Redesigning site layout, copy, navigation, or marketing sections beyond what is necessary to swap logo assets.",
    "Implementing new authentication, CMS, or backend storage related to branding."
  ],
  "imageRequirements": {
    "required": [
      "Upgraded solar + panel emblem logo, transparent background (solar-sparkle-logo-mark-transparent.dim_512x512.png)",
      "Upgraded horizontal logo lockup with emblem + wordmark on one line, transparent background (solar-sparkle-logo-lockup-horizontal-transparent.dim_1200x300.png)",
      "Favicon derived from the upgraded emblem, transparent background (favicon-solar-sparkle.dim_64x64.png)"
    ],
    "edits": [
      "Refine/modernize existing transparent logo mark while preserving concept (solar-sparkle-logo-transparent.dim_200x200.png > solar-sparkle-logo-transparent-v2.dim_200x200.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}